from typing import Optional
from llama_index.core.bridge.pydantic import BaseModel

flight_tickets_info = [
    ["北京", "大兴机场", "上海", "虹桥机场", "2024-08-01", 830.5],
    ["上海", "虹桥机场", "北京", "大兴机场", "2024-08-01", 659.0],
    ["广州", "白云机场", "上海", "虹桥机场", "2024-08-01", 789.5],
    ["上海", "虹桥机场", "广州", "白云机场", "2024-08-01", 800.4],
    ["北京", "大兴机场", "广州", "白云机场", "2024-08-01", 870.5],
    ["上海", "虹桥机场", "广州", "白云机场", "2024-08-02", 1200.6],
    ["北京", "大兴机场", "广州", "白云机场", "2024-08-02", 1020.0],
    ["上海", "虹桥机场", "北京", "大兴机场", "2024-08-02", 720.6],
    ["广州", "白云机场", "上海", "虹桥机场", "2024-08-02", 670.8],
    ["广州", "白云机场", "深圳", "宝安机场", "2024-08-03", 430.2],
    ["北京", "大兴机场", "深圳", "宝安机场", "2024-08-03", 1250.8],
    ["上海", "虹桥机场", "武汉", "天河机场", "2024-08-03", 950.3],
    ["北京", "大兴机场", "成都", "双流机场", "2024-08-03", 1100.4],
    ["上海", "虹桥机场", "北京", "首都机场", "2024-08-04", 620.5],
    ["北京", "首都机场", "上海", "虹桥机场", "2024-08-04", 580.3],
    ["深圳", "宝安机场", "重庆", "江北机场", "2024-08-04", 430.2],
    ["重庆", "江北机场", "成都", "双流机场", "2024-08-04", 320.7],
    ["成都", "双流机场", "广州", "白云机场", "2024-08-04", 520.9],
    ["广州", "白云机场", "深圳", "宝安机场", "2024-08-05", 430.2],
    ["上海", "虹桥机场", "深圳", "宝安机场", "2024-08-05", 520.8],
    ["天津", "滨海机场", "济南", "遥墙机场", "2024-08-05", 270.1],
    ["重庆", "江北机场", "上海", "虹桥机场", "2024-08-05", 580.3],
    ["成都", "双流机场", "重庆", "江北机场", "2024-08-05", 320.7],
]

flight_tickets = {}


class AirportTickets(BaseModel):
    dep_city: Optional[str] = None
    dep_airport: Optional[str] = None
    arr_city: Optional[str] = None
    arr_airport: Optional[str] = None
    flight_date: Optional[str] = None
    price: Optional[float] = None


for ft in flight_tickets_info:
    key = f"{ft[0]}-{ft[1]}-{ft[2]}-{ft[3]}-{ft[4]}"
    flight_tickets[key] = AirportTickets(
        dep_city=ft[0],
        dep_airport=ft[1],
        arr_city=ft[2],
        arr_airport=ft[3],
        flight_date=ft[4],
        price=ft[5],
    )


train_tickets_info = [
    ["北京", "上海", "2024-08-01", 780],
    ["广州", "深圳", "2024-08-01", 340],
    ["成都", "重庆", "2024-08-01", 290],
    ["杭州", "苏州", "2024-08-01", 120],
    ["武汉", "南京", "2024-08-01", 560],
    ["青岛", "大连", "2024-08-02", 480],
    ["西安", "长沙", "2024-08-02", 480],
    ["沈阳", "厦门", "2024-08-02", 980],
    ["天津", "宁波", "2024-08-02", 860],
    ["厦门", "南昌", "2024-08-02", 380],
    ["上海", "北京", "2024-08-03", 850],
    ["成都", "西安", "2024-08-03", 910],
    ["深圳", "上海", "2024-08-03", 700],
    ["重庆", "杭州", "2024-08-03", 760],
    ["广州", "武汉", "2024-08-03", 820],
    ["南京", "成都", "2024-08-04", 750],
    ["天津", "深圳", "2024-08-04", 880],
    ["杭州", "重庆", "2024-08-04", 660],
    ["苏州", "南京", "2024-08-04", 940],
    ["北京", "天津", "2024-08-04", 720],
    ["武汉", "重庆", "2024-08-05", 780],
    ["西安", "广州", "2024-08-05", 830],
    ["上海", "南京", "2024-08-05", 960],
    ["深圳", "苏州", "2024-08-05", 905],
    ["成都", "杭州", "2024-08-05", 690],
]


train_tickets = {}


class TrainTickets(BaseModel):
    start_city: Optional[str] = None
    end_city: Optional[str] = None
    train_date: Optional[str] = None
    price: Optional[float] = None


for tt in train_tickets_info:
    key = f"{tt[0]}-{tt[1]}-{tt[2]}"
    train_tickets[key] = TrainTickets(
        start_city=tt[0], end_city=tt[1], train_date=tt[2], price=tt[3]
    )
